Revit 2024 API
StructuralSection.SectionArea Property
 Cross section area.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double SectionArea { get; set; }
Visual Basic
Public Property SectionArea As Double
	Get
	Set
Visual C++
public:
property double SectionArea {
	double get ();
	void set (double value);
}
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace